---
kind: method
id: M:Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.GetTypeIds
source: html/8025a8bc-97bf-f725-2e72-efe8010bc037.htm
---
# Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.GetTypeIds Method

Returns ids of the types with duplicate names.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetTypeIds()
```